/*
    1) Строки.
    Описать функцию, возвращающую строку с двоичным представлением десятичного числа, 
	переданного в аргументе этой функции.
    
	
	2) Структуры.
    Описать структуру "прямоугольник", содержащую целочисленные значения длины, ширины,
	периметра и площади прямоугольника.
	Написать функцию, принимающую на вход указатель на структуру, 
	подсчитывающую и записывающую площадь и периметр данного прямоугольника в структуру.
   
   
    3) Выделение памяти.
    Написать функцию - обёртку, возвращающую указатель на область памяти, 
	которую затем можно использовать как массив из элементов типа integer.
	Количество элементов указывается в аргументе функции.
	Массив должен быть гарантированно инициализирован нулями.Для проверки - заполните этот массив и выведите на экран.
    
	
	
	После того как вы сделаете домашнее задание, ознакомьтесь, пожалуйста, 
	с видеозаписью "Решение домашнего задания урок 14" в разделе "Материалы" справа.


*/
