#include <stdio.h>

int LessonFive_main() {
	printf("This is lesson five homework!\n");

	/*
	Домашнее задание :

	1) Математика.
	Есть формула(расчёта резисторного делителя) Uo = Ui * (R1 / (R2 + R1)).

	Напишите формулы расчёта каждой переменной по отдельности, в формате :
	Ui = ...;
	R1 = ...;
	R2 = ...;
	
	2) Условия.
	Запросить у пользователя любое целое число.Написать программу которая проверит, 
	входит ли введённое число в диапазон(например, от 0 до 100, включительно) и выведет на экран сообщение о результате проверки.
		
	3) Циклы.
	Запросить у пользователя десять чисел.Вывести на экран среднее арифметическое введённых чисел.
	
	4) Звёздочка.
	Запросить у пользователя количество используемых для вывода строк.
	Написать программу, которая при помощи циклов и символа^ будет рисовать на указанном количестве строк равнобедренный треугольник.
	
	После того как вы сделаете домашнее задание, ознакомьтесь, пожалуйста,
	с видеозаписью "Решение домашнего задания урок 5" в разделе "Материалы" справа.
	*/
	return 0;
}