/*
 * Source.c
 *
 *  Created on: 24 сент. 2019 г.
 *      Author: wolfm
 *
 *  1. Ввести вес и рост человека. Рассчитать и вывести индекс массы тела по формуле I=m/(h*h); где m-масса тела в килограммах, h - рост в метрах.
 *
	3. Написать программу обмена значениями двух целочисленных переменных:
		b. *без использования третьей переменной.

	4. Написать программу нахождения корней заданного квадратного уравнения.

	6. Ввести возраст человека (от 1 до 150 лет) и вывести его вместе с последующим словом «год», «года» или «лет».

	7. Имеются числовые координаты двух полей шахматной доски (x1,y1,x2,y2). Требуется определить, относятся ли к поля к одному цвету или нет.

	9. Даны целые положительные числа N и K. Используя только операции сложения и вычитания, найти частное от деления нацело N на K, а также остаток от этого деления.

	10. Дано целое число N (> 0). С помощью операций деления нацело и взятия остатка от деления определить, имеются ли в записи числа N нечетные цифры.
	Если имеются, то вывести True, если нет — вывести False.

	14. * Автоморфные числа. Натуральное число называется автоморфным, если оно равно последним цифрам своего квадрата. Например, 25 \ :sup: 2 = 625.
	Напишите программу, которая выводит на экран все автоморфные числа, в пределах 1_000_000
 */
#include <stdio.h>
int main(){
	setvbuf(stdout, NULL, _IONBF, 0);

	//setbuf(stdout, NULL);
	//setbuf(stdin, NULL);
}
